app/Domain/Order/Queries/GetOrderByIdQuery.php

select * from `order_products` where `order_products`.`order_id` in (1)
select * from `orders` where `id` = 1 limit 1
select * from `products` where `products`.`id` in (5, 9, 15, 28)
---
    public function handle()
    {
        return Order::where('id', $this->id)->with(['orderProducts' => static function($query) {
            return $query->selectRaw('*, price*quantity as total');
        }])->firstOrFail();