app/Domain/Order/Queries/GetOrdersQuery.php

    public function handle()
    {
        return Order::with(['partner', 'orderProducts' => static function($query) {
                return $query->selectRaw('*, price*quantity as total');
            }])
            ->limit(20)
            ->get();
---
select * from `orders` limit 20
select * from `partners` where `partners`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select * from `products` where `products`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30)
select *, price*quantity as total from `order_products` where `order_products`.`order_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)